cmsis-svd/cmsis-svd/data/Renesas/R7FA2A1AB.svd
                <register>
                    <name>DCPMAXP</name>
                    <description>DCP Maximum Packet Size Register</description>
                    <addressOffset>0x05E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0040</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DEVSEL</name>
                            <description>Device Select</description>
                            <lsb>12</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000</name>
                                    <description>Address 0000</description>
                                    <value>#0000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0001</name>
                                    <description>Address 0001</description>
                                    <value>#0001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0010</name>
                                    <description>Address 0010</description>
                                    <value>#0010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0011</name>
                                    <description>Address 0011</description>
                                    <value>#0011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0100</name>
                                    <description>Address 0100</description>
                                    <value>#0100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0101</name>
                                    <description>Address 0101</description>
                                    <value>#0101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Settings prohibited.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>7</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MXPS</name>
                            <description>Maximum Packet SizeThese bits set the maximum amount of data (maximum packet size) in payloads for the DCP.</description>
                            <lsb>0</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0001000</name>
                                    <description>8bytes</description>
                                    <value>#0001000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0010000</name>
                                    <description>16bytes</description>
                                    <value>#0010000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0011000</name>
                                    <description>24bytes</description>
                                    <value>#0011000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0100000</name>
                                    <description>32bytes</description>
                                    <value>#0100000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0101000</name>
                                    <description>40bytes</description>
                                    <value>#0101000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0110000</name>
                                    <description>48bytes</description>
                                    <value>#0110000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0111000</name>
                                    <description>56bytes</description>
                                    <value>#0111000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1000000</name>
                                    <description>64bytes</description>
                                    <value>#1000000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1001000</name>
                                    <description>72bytes</description>
                                    <value>#1001000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1010000</name>
                                    <description>80bytes</description>
                                    <value>#1010000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1011000</name>
                                    <description>88bytes</description>
                                    <value>#1011000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1100000</name>
                                    <description>96bytes</description>
                                    <value>#1100000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1101000</name>
                                    <description>104bytes</description>
                                    <value>#1101000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1110000</name>
                                    <description>112bytes</description>
                                    <value>#1110000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1111000</name>
                                    <description>120bytes</description>
                                    <value>#1111000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DCPCTR</name>
                    <description>DCP Control Register</description>
                    <addressOffset>0x060</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0040</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BSTS</name>
                            <description>Buffer Status</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Buffer access is disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Buffer access is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SUREQ</name>
                            <description>Setup Token Transmission</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Invalid</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Transmits the setup packet.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>12</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SUREQCLR</name>
                            <description>SUREQ Bit Clear</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Invalid</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Clears the SUREQ bit to 0.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>9</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SQCLR</name>
                            <description>Sequence Toggle Bit Clear</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Invalid</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Specifies DATA0.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SQSET</name>
                            <description>Sequence Toggle Bit Set</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Invalid</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Specifies DATA1.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SQMON</name>
                            <description>Sequence Toggle Bit Monitor</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>DATA0</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>DATA1</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PBUSY</name>
                            <description>Pipe Busy</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>DCP is not used for the transaction.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>DCP is used for the transaction.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>3</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CCPL</name>
                            <description>Control Transfer End Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Invalid</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Completion of control transfer is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Response PID</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>NAK response</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>BUF response (depending on the buffer state)</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>STALL response</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>STALL response</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PIPESEL</name>
                    <description>Pipe Window Select Register</description>
                    <addressOffset>0x064</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000. The write value should be 000000000000.</description>
                            <lsb>4</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIPESEL</name>
                            <description>Pipe Window Select</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0000</name>
                                    <description>No pipe selected</description>
                                    <value>#0000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0100</name>
                                    <description>PIPE4</description>
                                    <value>#0100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0101</name>
                                    <description>PIPE5</description>
                                    <value>#0101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0110</name>
                                    <description>PIPE6</description>
                                    <value>#0110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0111</name>
                                    <description>PIPE7</description>
                                    <value>#0111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Settings prohibited.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
