cmsis-svd/cmsis-svd/data/Renesas/R7FA2A1AB.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="GPT161">
            <name>GPT162</name>
            <description>General PWM Timer 2 (16-bit)</description>
            <baseAddress>0x40078200</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT161">
            <name>GPT163</name>
            <description>General PWM Timer 3 (16-bit)</description>
            <baseAddress>0x40078300</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT161">
            <name>GPT164</name>
            <description>General PWM Timer 4 (16-bit)</description>
            <baseAddress>0x40078400</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT161">
            <name>GPT165</name>
            <description>General PWM Timer 5 (16-bit)</description>
            <baseAddress>0x40078500</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT161">
            <name>GPT166</name>
            <description>General PWM Timer 6 (16-bit)</description>
            <baseAddress>0x40078600</baseAddress>
        </peripheral>
        <peripheral>
            <name>POEG</name>
            <description>Port Output Enable Module for GPT</description>
            <baseAddress>0x40042000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>A,B</dimIndex>
                    <name>POEGG%s</name>
                    <description>POEG Group %s Setting Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>NFCS</name>
                            <description>Noise Filter Clock Select</description>
                            <lsb>30</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Sampling GTETRG pin input level for three times in every PCLKB. </description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Sampling GTETRG pin input level for three times in every PCLKB /8.</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Sampling GTETRG pin input level for three times in every PCLKB /32.</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Sampling GTETRG pin input level for three times in every PCLKB /128. </description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NFEN</name>
                            <description>Noise Filter Enable</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Filtering noise disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Filtering noise enabled </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INV</name>
                            <description>GTETRG Input Reverse</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTETRG Input</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTETRG Input Reversed.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000000000. The write value should be 00000000000.</description>
                            <lsb>17</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ST</name>
                            <description>GTETRG Input Status Flag</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>GTETRG input after filtering is 0.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GTETRG input after filtering is 1. </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>14</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CDRE5</name>
                            <description>ACMP_LP1 EnableNote: Can be modified only once after a reset.</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable output-disable request from ACMPLP1.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable output-disable request from ACMPLP1.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CDRE4</name>
                            <description>ACMP_LP0 EnableNote: Can be modified only once after a reset.</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable output-disable request from ACMPLP0.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable output-disable request from ACMPLP0.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>9</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CDRE0</name>
                            <description>ACMP_HS0 EnableNote: Can be modified only once after a reset.</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable output-disable request from ACMPHS0.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable output-disable request from ACMPHS0.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OSTPE</name>
                            <description>Oscillation Stop Detection EnableNote: Can be modified only once after a reset.</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>A output-disable request from the oscillation stop detection disabled. </description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A output-disable request from the oscillation stop detection enabled.   </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IOCE</name>
                            <description>Real Time Overcurrent EnableNote: Can be modified only once after a reset.</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>A output-disable request from GPT disable request or comparator interrupt disabled. </description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A output-disable request from GPT disable request or comparator interrupt enabled. </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PIDE</name>
                            <description>Port Input Detection EnableNote: Can be modified only once after a reset.</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>A output-disable request from the GTETRG pins disabled. </description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A output-disable request from the GTETRG pins enabled. </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SSF</name>
                            <description>Software Stop Flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>A output-disable request from software has not been generated. </description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A output-disable request from software has been generated. </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OSTPF</name>
                            <description>Oscillation Stop Detection Flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>A output-disable request from the oscillation stop detection has not been generated. </description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A output-disable request from the oscillation stop detection has been generated. </description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IOCF</name>
                            <description>Real Time Overcurrent Detection Flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No output-disable request from the GPT, the ACMPHS or the ACMPLP occurred.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Output-disable request from the GPT, the ACMPHS or the ACMPLP occurred.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PIDF</name>
                            <description>Port Input Detection Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>A output-disable request from the GTETRG pin has not been generated. </description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>A output-disable request from the GTETRG pin has been generated.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
