cmsis-svd/cmsis-svd/data/Renesas/R7FA2A1AB.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>FCACHE</name>
            <description>Flash Cache</description>
            <baseAddress>0x4001C000</baseAddress>
            <addressBlock>
                <offset>0x100</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x104</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x11C</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>FCACHEE</name>
                    <description>Flash Cache Enable Register</description>
                    <addressOffset>0x100</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000000. The write value should be 000000000000000.</description>
                            <lsb>1</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FCACHEEN</name>
                            <description>FCACHE Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>FCACHE is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>FCACHE is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCACHEIV</name>
                    <description>Flash Cache Invalidate Register</description>
                    <addressOffset>0x104</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000000000000000. The write value should be 000000000000000.</description>
                            <lsb>1</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FCACHEIV</name>
                            <description>FCACHE Invalidation</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToSet</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>(Read)not in progress / (Write) no effect.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>(Read)in progress /(Write)  Starting Cache Invalidation</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>PORT0</name>
            <description>Port 0 Control Registers</description>
            <baseAddress>0x40040000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x00</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x06</offset>
                <size>6</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x08</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>PCNTR1</name>
                    <description>Port Control Register 1</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>PODR</name>
                    <description>Output data register</description>
                    <alternateRegister>PCNTR1</alternateRegister>
                    <addressOffset>0x00</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PDR</name>
                    <description>Direction register</description>
                    <alternateRegister>PCNTR1</alternateRegister>
                    <addressOffset>0x02</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>PCNTR2</name>
                    <description>Port Control Register 2</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFF0000</resetMask>
                </register>
                <register>
                    <name>PIDR</name>
                    <description>Input data register</description>
                    <alternateRegister>PCNTR2</alternateRegister>
                    <addressOffset>0x06</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0000</resetMask>
                </register>
                <register>
                    <name>PCNTR3</name>
                    <description>Port Control Register 3</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>PORR</name>
                    <description>Output reset register</description>
                    <alternateRegister>PCNTR3</alternateRegister>
                    <addressOffset>0x08</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>POSR</name>
                    <description>Output set register</description>
                    <alternateRegister>PCNTR3</alternateRegister>
                    <addressOffset>0x0A</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
