cmsis-svd/cmsis-svd/data/Renesas/R7FA2A1AB.svd
                <register derivedFrom="P100PFS">
                    <name>P200PFS</name>
                    <description>P200 Pin Function Control Register</description>
                    <addressOffset>0x080</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register derivedFrom="P100PFS_HA">
                    <name>P200PFS_HA</name>
                    <description>P200 Pin Function Control Register</description>
                    <addressOffset>0x082</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register derivedFrom="P100PFS_BY">
                    <name>P200PFS_BY</name>
                    <description>P200 Pin Function Control Register</description>
                    <addressOffset>0x083</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register derivedFrom="P100PFS">
                    <name>P201PFS</name>
                    <description>P201 Pin Function Control Register</description>
                    <addressOffset>0x084</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000010</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register derivedFrom="P100PFS_HA">
                    <name>P201PFS_HA</name>
                    <description>P201 Pin Function Control Register</description>
                    <addressOffset>0x086</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0010</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register derivedFrom="P100PFS_BY">
                    <name>P201PFS_BY</name>
                    <description>P201 Pin Function Control Register</description>
                    <addressOffset>0x087</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register derivedFrom="P100PFS">
                    <dim>3</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>4-6</dimIndex>
                    <name>P20%sPFS</name>
                    <description>P20%s Pin Function Control Register</description>
                    <addressOffset>0x090</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register derivedFrom="P100PFS_HA">
                    <dim>3</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>4-6</dimIndex>
                    <name>P20%sPFS_HA</name>
                    <description>P20%s Pin Function Control Register</description>
                    <addressOffset>0x092</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register derivedFrom="P100PFS_BY">
                    <dim>3</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>4-6</dimIndex>
                    <name>P20%sPFS_BY</name>
                    <description>P20%s Pin Function Control Register</description>
                    <addressOffset>0x093</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register derivedFrom="P100PFS">
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>12-15</dimIndex>
                    <name>P2%sPFS</name>
                    <description>P2%s Pin Function Control Register</description>
                    <addressOffset>0x0B0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register derivedFrom="P100PFS_HA">
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>12-15</dimIndex>
                    <name>P2%sPFS_HA</name>
                    <description>P2%s Pin Function Control Register</description>
                    <addressOffset>0x0B2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register derivedFrom="P100PFS_BY">
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>12-15</dimIndex>
                    <name>P2%sPFS_BY</name>
                    <description>P2%s Pin Function Control Register</description>
                    <addressOffset>0x0B3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register derivedFrom="P000PFS">
                    <name>P300PFS</name>
                    <description>P300 Pin Function Control Register</description>
                    <addressOffset>0x0C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00010010</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register derivedFrom="P000PFS_HA">
                    <name>P300PFS_HA</name>
                    <description>P300 Pin Function Control Register</description>
                    <addressOffset>0x0C2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0010</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register derivedFrom="P000PFS_BY">
                    <name>P300PFS_BY</name>
                    <description>P300 Pin Function Control Register</description>
                    <addressOffset>0x0C3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register derivedFrom="P000PFS">
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-4</dimIndex>
                    <name>P30%sPFS</name>
                    <description>P30%s Pin Function Control Register</description>
                    <addressOffset>0x0C4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register derivedFrom="P000PFS_HA">
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-4</dimIndex>
                    <name>P30%sPFS_HA</name>
                    <description>P30%s Pin Function Control Register</description>
                    <addressOffset>0x0C6</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register derivedFrom="P000PFS_BY">
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-4</dimIndex>
                    <name>P30%sPFS_BY</name>
                    <description>P30%s Pin Function Control Register</description>
                    <addressOffset>0x0C7</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register derivedFrom="P000PFS">
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>P40%sPFS</name>
                    <description>P40%s Pin Function Control Register</description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register derivedFrom="P000PFS_HA">
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>P40%sPFS_HA</name>
                    <description>P40%s Pin Function Control Register</description>
                    <addressOffset>0x102</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register derivedFrom="P000PFS_BY">
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>P40%sPFS_BY</name>
                    <description>P40%s Pin Function Control Register</description>
                    <addressOffset>0x103</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
